app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @songs = Artist.find_by_id(params[:artist_id]).songs
    else
      @songs = Song.all